myapp/app/Models/estacion.php

    public function getGoogleLine(){
        $aux = $this->select('id,temperatura,humedad,presion,altitud')->orderBy('id', 'asc')->findAll();
---
SELECT `id`, `temperatura`, `humedad`, `presion`, `altitud`
FROM `estacion`
ORDER BY `id` ASC