myapp/app/Controllers/Rest.php

INSERT INTO `estacion` (`temperatura`, `humedad`, `presion`, `altitud`) VALUES ('25', '43', '120', '15')
---
    public function espPost(){
     if ($this->request->getPost()){
            $model = new estacion();
            $data=[
                'temperatura'=>$this->request->getVar('temperatura'),
                'humedad'=>$this->request->getVar('humedad'),
                'presion'=>$this->request->getVar('presion'),
                'altitud'=>$this->request->getVar('altitud'),
            ];
            $model->insert($data);